Revit 2027 API
RebarConstraint.GetTargetRebarHandleBehavior Method
 Gets the RebarHandleBehavior of the handle of the other Rebar Element to which this RebarConstraint is attached. The RebarConstraintType of the RebarConstraint must be 'ToOtherRebar'.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarHandleBehavior GetTargetRebarHandleBehavior()
Public Function GetTargetRebarHandleBehavior As RebarHandleBehavior
public:
RebarHandleBehavior GetTargetRebarHandleBehavior()
member GetTargetRebarHandleBehavior : unit -> RebarHandleBehavior
Return Value
RebarHandleBehavior
 Returns the RebarHandleBehavior of the handle of the other Rebar Element to which this RebarConstraint is attached.
Exceptions
Exception | Condition
InvalidOperationException |  RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'. -or- Constrained rebar isn't a Shape Driven Rebar element.
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace